using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;


public class ErrorMsgCode
{
    /// <summary>
    /// 错误代码字典
    /// </summary>
    public static Dictionary<int, string> ErrorDic = new Dictionary<int, string>() { {0,"" }
        ,{ 101, "激活码不存在" }
        ,{ 102, "该批次激活码还未启用" }
        ,{ 103, "该批次激活码已过期" }
        ,{ 104, "当前激活码不能使用在此课本上" }
        ,{ 105,"当前激活课程与之前激活课程不匹配"}
        ,{ 106,"当前用户与之前激活的用户不匹配"}
        ,{ 107,"激活课程失败，课程信息有误"}
        ,{ 110,"PC端设备使用超过限制"}
        ,{ 111,"移动端设备使用超过限制"}
        ,{ 112,"当前授权码不允许使用此类设备"}
        ,{ 113,"当前设备已经使用过此激活码" }
        ,{ 114,"bookid参数错误"}
        ,{ 116,"当前设备类型只能是客户端或者移动设备"}
        ,{115,"当前批次的课程信息不存在"}
        ,{117,"当前批次激活码已禁用"}
        ,{118,"当前批次类型已禁用"}
        ,{119,"终端设备使用超过限制"}
        ,{ 201,"未知的激活码类型" }
        ,{ 202,"批次课程信息不存在"}
        ,{ 301,"服务内部错误，插入数据操作失败"}
        ,{ 401,"请求接口失效"}
        ,{ 402,"用户未购买过此课程"}
        ,{ 403,"解密失败"}
        ,{ 404,"接口访问异常"}

        };
}


